Samples/RetrieveRewardRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:type="http://www.ibsplc.com/iloyal/redemption/retrievereward/type/">
    <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
         <wsu:Timestamp wsu:Id="Timestamp-20046406" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
            <wsu:Expires>2020-01-11T10:33:52.303Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="UsernameToken-20914066" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsse:Username>mtn</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">JC9UDunh4V5pRSEofoUgTur9u5g=</wsse:Password>
            <wsse:Nonce>5lXRolFB0oWSOjRgioe4DA==</wsse:Nonce>
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <type:RetrieveRewardRequest>
         <companyCode>SA</companyCode>
         <programCode>VOYAG</programCode>
         <carrierCode></carrierCode>
         <partnerCode>MTS</partnerCode>
         <rewardCode></rewardCode>
         <rewardGroup>L</rewardGroup>
         <startDate></startDate>
         <endtDate></endtDate>
         <!--Zero or more repetitions:-->
         <dynamicAttributes>
            <attributeCode></attributeCode>
            <attributeValue></attributeValue>
         </dynamicAttributes>
         <FlightDetail>
            <isRoundTripPermitted>1</isRoundTripPermitted>
            <!--Zero or more repetitions:-->
            <permittedSegments>
               <origin></origin>
               <destination></destination>
               <originRegion></originRegion>
               <destinationRegion></destinationRegion>
               <bookingClass></bookingClass>
               <!--Zero or more repetitions:-->
               <viaAirports>
                  <airport></airport>
               </viaAirports>
            </permittedSegments>
         </FlightDetail>
         <pageNumber>1</pageNumber>
         <absoluteIndex>1</absoluteIndex>
         <txnHeader>
            <transactionID>D4A070B5D70946E5BB978D48FE734F00</transactionID>
            <userName>mtn</userName>
            <!--Optional:-->
            <transactionToken></transactionToken>
            <timeStamp>2020-01-11T10:33:52.303Z</timeStamp>
         </txnHeader>
      </type:RetrieveRewardRequest>
   </soapenv:Body>
</soapenv:Envelope>